In [1]:
import pandas as pd
import numpy as np

In [2]:
#Database style DataFrame Joins
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                   "data1": pd.Series(range(7), dtype="Int64")})

In [3]:
df2 = pd.DataFrame({"key": ["a", "b", "d"],
                   "data2": pd.Series(range(3), dtype="Int64")})

In [4]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [7]:
df3 = pd.DataFrame({"key": ["a", "b", "c"],
                  "data3": pd.Series(range(3), dtype="Int64")})

In [8]:
df3

  key  data3
0   a      0
1   b      1
2   c      2

In [9]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [10]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [12]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                   "data1": pd.Series(range(7), dtype="Int64")})

In [13]:
df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
                   "data2": pd.Series(range(3), dtype="Int64")})

In [14]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [15]:
pd.merge(df1, df2, how="outer")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3   <NA>
7   d   <NA>      2

In [16]:
a = 5.6

In [17]:
s = str(a)

In [18]:
s

'5.6'

In [20]:
s = 'python'

In [21]:
list(s)

['p', 'y', 't', 'h', 'o', 'n']

In [22]:
s[:3]

'pyt'

In [23]:
s = "12\\34"

In [24]:
print(s)

12\34

In [25]:
s = r"This\has\no\special\characters"

In [26]:
s

'This\\has\\no\\special\\characters'

In [27]:
a = "this is the first half"

In [28]:
b = "and this is the second half"

In [29]:
a + b

'this is the first halfand this is the second half'

In [30]:
template = "{0:.2f} {1:s} are worth US${2:d}"

In [31]:
template.format(88.46, "Argentine Pesos", 1)

'88.46 Argentine Pesos are worth US$1'

In [32]:
amount = 10

In [33]:
rate = 88.46

In [34]:
currency = "Pesos"

In [35]:
result = f"{amount} {currency} is worth US${amount / rate}"

In [36]:
val = "espanol"

In [37]:
val

'espanol'

In [38]:
data = pd.Series(np.random.uniform(size=9),
                index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                      [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [39]:
data

a  1    0.618251
   2    0.656899
   3    0.440167
b  1    0.163952
   3    0.721105
c  1    0.767331
   2    0.556300
d  2    0.682165
   3    0.180468
dtype: float64

In [40]:
data["b"]

1    0.163952
3    0.721105
dtype: float64

In [41]:
data["b":"c"]

b  1    0.163952
   3    0.721105
c  1    0.767331
   2    0.556300
dtype: float64

In [42]:
data.loc[["b", "d"]]

b  1    0.163952
   3    0.721105
d  2    0.682165
   3    0.180468
dtype: float64

In [43]:
data.loc[:, 2]

a    0.656899
c    0.556300
d    0.682165
dtype: float64

In [44]:
data.unstack()

          1         2         3
a  0.618251  0.656899  0.440167
b  0.163952       NaN  0.721105
c  0.767331  0.556300       NaN
d       NaN  0.682165  0.180468

In [45]:
data.unstack().stack()

a  1    0.618251
   2    0.656899
   3    0.440167
b  1    0.163952
   3    0.721105
c  1    0.767331
   2    0.556300
d  2    0.682165
   3    0.180468
dtype: float64

In [47]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                    columns=[["Ohio", "Ohio", "Colorada"],
                            ["Green", "Red", "Green"]])

In [48]:
frame

     Ohio     Colorada
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [49]:
frame.index.names = ["key1", "key2"]

In [50]:
frame.columns.names = ["state", "color"]

In [51]:
frame

state      Ohio     Colorada
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [52]:
frame.index.nlevels

2

In [53]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [54]:
pd.MultiIndex.from_arrays([["Ohio", "Ohio", "Colorado"],
                          ["Green", "Red", "Green"]],
                         names=["state", "color"])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [55]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorada
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [56]:
frame.sort_index(level=1)

state      Ohio     Colorada
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [57]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorada
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [58]:
frame.groupby(level="key2").sum()

state  Ohio     Colorada
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [60]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                     "c": ["one", "one", "one", "two", "two", "two", "two"],
                     "d": [0, 1, 2, 0, 1, 2, 3]})

In [61]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [62]:
frame2 = frame.set_index(["c", "d"])

In [63]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [64]:
frame.set_index(["c", "d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [65]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [66]:
#Combining and Merging Datasets
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                   "data1": pd.Series(range(7), dtype="Int64")})

In [67]:
df2 = pd.DataFrame({"key": ["a", "b", "d"],
                   "data2": pd.Series(range(3), dtype="Int64")})

In [68]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [69]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [70]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [71]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [72]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                   "data1": pd.Series(range(7), dtype="Int64")})

In [73]:
df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
                   "data2": pd.Series(range(3), dtype="Int64")})

In [74]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [75]:
pd.merge(df1, df2, how="outer")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3   <NA>
7   d   <NA>      2

In [76]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey", how="outer")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [77]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [78]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [79]:
pd.merge(df1, df2, on="key", how="left")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   c      3   <NA>
4   a      4      0
5   a      5      0
6   b      6      1

In [80]:
pd.merge(df1, df2, how="inner")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [81]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],
                    "key2": ["one", "two", "one"],
                    "lval": pd.Series([1, 2, 3], dtype="Int64")})

In [82]:
right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                     "key2": ["one", "one", "one", "two"],
                     "rval": pd.Series([4, 5, 6, 7], dtype='Int64')})

In [83]:
pd.merge(left, right, on=["key1", "key2"], how="outer")

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2  <NA>
3  bar  one     3     6
4  bar  two  <NA>     7

In [84]:
pd.merge(left, right, on="key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [85]:
pd.merge(left, right, on="key1", suffixes=("_left", "_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [86]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                     "value": pd.Series(range(6), dtype="Int64")})

In [87]:
right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [88]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [89]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [90]:
right1

   group_val
a        3.5
b        7.0

In [91]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0